benchmarks/surf_results/bloom_readrandom.txt
Keys:       16 bytes each
Values:     100 bytes each (50 bytes after compression)
Entries:    1000000
RawSize:    110.6 MB (estimated)
FileSize:   62.9 MB (estimated)
Filter:     bloom
------------------------------------------------
fillrandom   :       2.495 micros/op;   44.3 MB/s
readrandom   :       2.847 micros/op; (632150 of 1000000 found)