benchmarks/surf_results/bloom_surfscan25.txt
Keys:       16 bytes each
Values:     100 bytes each (50 bytes after compression)
Entries:    1000000
RawSize:    110.6 MB (estimated)
FileSize:   62.9 MB (estimated)
Filter:     bloom
------------------------------------------------
fillrandom   :       2.791 micros/op;   39.6 MB/s
surfscan25   :       7.214 micros/op; (5215152 keys scanned, miss=249687 hit=750313, width=10)