benchmarks/surf_results/bloom_surfscan75.txt
Keys:       16 bytes each
Values:     100 bytes each (50 bytes after compression)
Entries:    1000000
RawSize:    110.6 MB (estimated)
FileSize:   62.9 MB (estimated)
Filter:     bloom
------------------------------------------------
fillrandom   :       2.575 micros/op;   43.0 MB/s
surfscan75   :       3.922 micros/op; (1736663 keys scanned, miss=750115 hit=249885, width=10)