benchmarks/surf_results/bloom_surfscan_wide.txt
Keys:       16 bytes each
Values:     100 bytes each (50 bytes after compression)
Entries:    1000000
RawSize:    110.6 MB (estimated)
FileSize:   62.9 MB (estimated)
Filter:     bloom
------------------------------------------------
fillrandom   :       2.615 micros/op;   42.3 MB/s
surfscan_wide :       1.361 micros/op; (0 keys scanned, miss=1000000 hit=0, width=100)