benchmarks/surf_results/surf_readrandom.txt
Keys:       16 bytes each
Values:     100 bytes each (50 bytes after compression)
Entries:    1000000
RawSize:    110.6 MB (estimated)
FileSize:   62.9 MB (estimated)
Filter:     surf
------------------------------------------------
fillrandom   :       4.282 micros/op;   25.8 MB/s
readrandom   :       8.977 micros/op; (632150 of 1000000 found)