benchmarks/surf_results/surf_readseq.txt
Keys:       16 bytes each
Values:     100 bytes each (50 bytes after compression)
Entries:    1000000
RawSize:    110.6 MB (estimated)
FileSize:   62.9 MB (estimated)
Filter:     surf
------------------------------------------------
fillrandom   :       3.361 micros/op;   32.9 MB/s
readseq      :       0.447 micros/op;  247.4 MB/s