benchmarks/surf_results/surf_surfscan100.txt
Keys:       16 bytes each
Values:     100 bytes each (50 bytes after compression)
Entries:    1000000
RawSize:    110.6 MB (estimated)
FileSize:   62.9 MB (estimated)
Filter:     surf
------------------------------------------------
fillrandom   :       3.936 micros/op;   28.1 MB/s
surfscan100  :       1.374 micros/op; (0 keys scanned, miss=1000000 hit=0, width=10)