benchmarks/surf_results/surf_surfscan50.txt
Keys:       16 bytes each
Values:     100 bytes each (50 bytes after compression)
Entries:    1000000
RawSize:    110.6 MB (estimated)
FileSize:   62.9 MB (estimated)
Filter:     surf
------------------------------------------------
fillrandom   :       4.100 micros/op;   27.0 MB/s
surfscan50   :       4.760 micros/op; (3478645 keys scanned, miss=499614 hit=500386, width=10)